TEST1/meshConvergenceStudy/cases/very_fine/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Generated for mesh convergence study - TEST1 UNIFORM MESH
// Refinement level: very_fine
// Refinement factor: 2.0x baseline
// Total cells: ~34.82M

scale 1e-6; // coordinates in micrometers

// LIFT GEOMETRY (bottom to top):
// y0 = 0.0000     - Substrate (receiver) bottom
// y1 = 8.0000     - Substrate top / Air gap bottom
// y2 = 20.0000    - Air gap top / Ti film bottom
// y3 = 20.0714    - Ti film top (71.4 nm thick)

vertices
(
    // y0 = 0.0000 (substrate/receiver bottom)
    (0   0.0000  0)  (50  0.0000  0)  (50  0.0000 10)  (0   0.0000 10)

    // y1 = 8.0000 (substrate top / air gap bottom)
    (0   8.0000  0)  (50  8.0000  0)  (50  8.0000 10)  (0   8.0000 10)

    // y2 = 20.0000 (air gap top / Ti film bottom)
    (0  20.0000  0)  (50 20.0000  0)  (50 20.0000 10)  (0  20.0000 10)

    // y3 = 20.0714 (Ti film top) - 71.4 nm thick film
    (0  20.0714  0)  (50 20.0714  0)  (50 20.0714 10)  (0  20.0714 10)
);

blocks
(
    // Substrate (receiver) - UNIFORM grading
    hex ( 0  3  2  1   4  7  6  5)   (160 800 80)  simpleGrading (1 1 1)

    // Air gap - UNIFORM grading
    hex ( 4  7  6  5   8 11 10  9)   (160 800 120)  simpleGrading (1 1 1)

    // Ti film (71.4 nm) - UNIFORM grading
    hex ( 8 11 10  9  12 15 14 13)   (160 800 72)  simpleGrading (1 1 1)
);

edges ();

boundary
(
    // Symmetry planes (external boundaries only)
    left          { type symmetryPlane; faces ((0 3 7 4)(4 7 11 8)(8 11 15 12)); }
    right         { type symmetryPlane; faces ((1 5 6 2)(5 9 10 6)(9 13 14 10)); }
    front         { type symmetryPlane; faces ((0 4 5 1)(4 8 9 5)(8 12 13 9)); }
    back          { type symmetryPlane; faces ((3 2 6 7)(7 6 10 11)(11 10 14 15)); }

    // Physical walls
    substrate     { type wall;  faces ((0 3 2 1)); }      // BOTTOM - receiver substrate
    donor         { type wall;  faces ((12 15 14 13)); }   // TOP - transparent donor substrate
);

mergePatchPairs();

// Cell size information:
// Substrate: 0.312 × 0.010 × 0.125 μm
// Air gap:   0.312 × 0.015 × 0.083 μm
// Ti film:   0.312 × 0.000 × 0.1389 μm (0.09 nm in z)

// ************************************************************************* //
