TEST1/meshConvergenceStudy/cases/very_fine/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Decompose for 12 cores (Intel i7-9750H with 12 threads)
numberOfSubdomains 6;
// Decomposition method
// scotch - automatic load balancing (recommended for complex geometries)
// hierarchical - decompose along coordinate directions
// simple - simple geometric decomposition
method          scotch;
// Optional: scotch coefficients for fine-tuning
scotchCoeffs
{
    processorWeights (1 1 1 1 1 1);
}

/*
 Alternative: hierarchical method (uncomment if preferred)
 hierarchicalCoeffs
 {
    n           (3 2 2);  // 3*2*2 = 12 subdomains
     delta       0.001;
     order       xyz;
}
 Alternative: simple method (uncomment if preferred)
 simpleCoeffs
{
     n           (3 2 2);  // 3*2*2 = 12 subdomains
     delta       0.001;
 }
 */
 
// Preserve patches and cyclic boundaries
distributed     no;
roots           ();
// ************************************************************************* //
