TEST1/meshConvergenceStudy/cases/very_fine/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // CORRECTED: Focus/jet region around Ti film (now at top)
    { 
        name focusBox; 
        type cellSet; 
        action new; 
        source boxToCell;
        sourceInfo
        {
            // Refined region around laser focus and expected jet trajectory
            // x: [16.6667, 33.3333] µm (aligned to blockMesh cell planes)
            // y: [18.0, 24.0] µm (covers Ti film + some air gap below)  
            // z: [2.5, 7.5] µm (centered around z=5 µm focus)
            box (16.6666667e-06 18.0e-06 2.5e-06)
                (33.3333333e-06 24.0e-06 7.5e-06);
        }
    }

    // CORRECTED: Substrate zone at BOTTOM of domain
    { 
        name substrateSet; 
        type cellSet; 
        action new; 
        source boxToCell;
        sourceInfo 
        { 
            // Substrate region: bottom layer only
            box (0 0 0) (50.0e-06 8.0000e-06 10.0e-06); 
        } 
    }
    
    { 
        name substrate; 
        type cellZoneSet; 
        action new; 
        source setToCellZone;
        sourceInfo 
        { 
            set substrateSet; 
        } 
    }
);

// ************************************************************************* //
